[
  {
    "id": "8fc3d839-ab2a-4f50-bfda-fea5aa8f6d75",
    "statement": "Increasing temperature from 20°C to 40°C will increase the reaction rate of the enzyme catalase by at least 50% when measured by the rate of oxygen production from hydrogen peroxide decomposition.",
    "rationale": "This hypothesis is based on the fundamental principle that enzyme activity increases with temperature due to increased kinetic energy of molecules, leading to more frequent and energetic collisions between enzyme and substrate. The Arrhenius equation describes this relationship, predicting approximately a doubling of reaction rate for every 10°C increase in temperature within the enzyme's optimal range. Catalase is a well-studied enzyme with a relatively high temperature optimum, making it suitable for testing this prediction. The limitation is that this relationship only holds until denaturation temperatures are approached, typically above 40-50°C for most enzymes.",
    "domain": "biology"
  },
  {
    "id": "f1bcaf81-e25a-4dcf-b276-fa4bd1be4466",
    "statement": "Exposure to temperatures above 50°C for 10 minutes will cause irreversible denaturation of amylase, reducing its activity by at least 80% compared to controls maintained at 37°C, as measured by starch hydrolysis rate.",
    "rationale": "This hypothesis is grounded in protein denaturation theory, where high temperatures disrupt the non-covalent interactions (hydrogen bonds, hydrophobic interactions) that maintain enzyme tertiary structure. Amylase, like most enzymes, has a defined temperature stability range beyond which irreversible structural changes occur. The prediction aligns with established biochemistry principles that enzyme denaturation follows first-order kinetics with temperature. The rationale acknowledges that different enzymes have varying thermal stability profiles, but amylase serves as a representative model system. A potential limitation is that some enzymes might exhibit partial reversibility of denaturation upon cooling.",
    "domain": "biology"
  }
]